[
    {
        "img": "../assets/images/innertune/thumbnail.png",
        "alt": "InnerTune",
        "name": "INNERTUNE",
        "button": "A 3D rhythm action game where the protagonist must face their emotions head on in a boss battle within various dreamscape worlds.",
        "info": "UE4 / Blueprints",
        "link": "/works/innertune",
        "content": [
            { "title": "Summary", "paragraph": "Innertune is a solo developement demo that I took as a learning experience to explore all the unique parts of creating a game from ideation to implementation. With a interest in music production, I wanted to create a game that incorporated the fluidity of a song into the combat of an action game, inspired by the rhythmic battles of Dark Souls and the fast paced combat of Kingdom Hearts. The original idea of Innertune was the protagonist facing emotional versions of themselves within a thematic world where each emotion represented a colour, genre of music, and combat style." },
            { "title": "Design", "paragraph": "The game was designed with the boss's attack patterns to match the anatomy of a song which is the intro, verse, chorus, bridge, and outro. This allowed for varying combat scenarios with the intention for the player to utilize both audio and visual cues to determine the best time to dodge and attack. The boss also features 3 distinct phases each introducing either a new attack, pattern, and/or obstacle that the player must face. This choice enables the player to face an increasing slope difficultly as well as encouraging them to learn the musical cues and similiar rhythmic attack patterns to aid in defeating the boss." },
            { "title": "", "paragraph": "Along with the rhythmic boss attacks there is another musical system implemented which is a seperate beat the plays alongside the music displayed in the top half of the UI. This beat is an indicator for the oportunity to perform an enhanced action if the player is able to time their attack, jump, or dash correctly. This is similiar to many rhythm games where you have to time your buttons to each note but instead of punishing the player for missing, this system is used as postive reinforcement. As their is a lot to process during the battle, performing actions to the beat is entirely optional and leads to rewarding the player with a stronger action that can aid them in battle to give them an easier time handling the boss." },
            { "title": "Development", "paragraph": "The most challenging system to design and program was the boss AI with it's varying attack patterns. There was a lot of balancing to do as the notes of each part of the song dictated the duration, amount, and speed of each attack. So to give the player a fighting chance, there were many tweaks to several values for each individual piece of the attack to allow the player timing to dodge. Another balance decision was to make sure was a period of time to allow the player a breather from the barrage of attacks. This would be in the intro and outro which slows down the gameplay allowing the player to play more offensive during these sections." }
        ],
        "images": [
            {"src": "../assets/images/innertune/gameplay.gif", "caption": "This demo boss represents sadness, with the genre of music being lofi, and has magical casting combat style."},
            {"src": "../assets/images/innertune/phase1.png", "caption": ""},
            {"src": "../assets/images/innertune/phase2.png", "caption": ""},
            {"src": "../assets/images/innertune/phase3.png", "caption": "These are attack patterns, and obstacles that occur during each phase. From left to right is phase 1, phase 2, and phase 3."},
            {"src": "../assets/images/innertune/enhance.gif", "caption": "An enhanced attack provides faster animation and more damage. An enhanced jump has increased height."},
            {"src": "../assets/images/innertune/intro.gif", "caption": "During the intro and outro the boss attacks with these screens that push the player away."}
        ],
        "herodata": [
            {"role": "Game Developer",
            "role2": "Game Designer",
            "skills": "Unreal Engine 4",
            "skills2": "Blueprints",
            "genre": "Rhythm",
            "genre2": "Action",
            "linkname": "Demo", "linkurl":"https://drive.google.com/file/d/1nHQ_ABLzn0p5aBie2LcCnplNmXVxHht5/view?usp=sharing"}
        ]
    },
    {
        "img": "../assets/images/thepark/thumbnail.png",
        "alt": "The Park In-between",
        "name": "THE PARK IN-BETWEEN",
        "button": "A 3D first person survival game where the player searches for keys to leave this haunted world.",
        "info": "Godot / GDScript",
        "link": "/works/theparkinbetween",
        "content": [
            { "title": "Summary", "paragraph": "The Park In-between is a 3D survival horror game we created for Spooky Jam 2021. With the theme being afterlife and a sub-theme of horror for halloween, our team of three came up with a first person shooting style game where the player must explore a dark, creepy, park-like area to find keys that will unlock the door to escape. The goal of the game was to make it feel mysterious and suspenseful as the afterlife is unknown and can be a possibility of many things." },
            { "title": "Design", "paragraph": "For the level design, we decided to create a more open field area so that our world can provide a sense of exploration and mystery. As the colour and lightning made it visbiliy eerie and harder to find the keys, we implemented a hint system where arrows that pointed toward the direction of the keys were scattered across the map. But as not to make the path linear, we spread them out in a way that made it so the arrows would point to another arrow for a different key letting the player know the general area of where other keys would be found giving them a choice of where to explore first." },
            { "title": "", "paragraph": "With there being five keys, we designed the discovery of the first key to be the easiest which would then provide guidance to other keys allowing the player to decide where to explore first. The other keys are then placed in their own area within the map, utilizing different landscapes and objects to provide a refreshing exploration experience. One of the main obstacles for the players is the ghosts scattered across the map that chase the player on sight. As stated before with the impediment of vision, we wanted to give players a warning to when a ghost is nearby so we added in a spacial sound that gets louder the closer the ghost gets to the player." },
            { "title": "Development", "paragraph": "One of the challenges that we faced was the scope of the level design, as our original terrain was much larger and more barren. We found that after some testing that players would get lost in a large field even with our arrow hint system as our vision system makes the surrounding area look the same. So the way we solved this challenge was to design the intended level design and terrain from a single starting point and creating unique landmarks that the player can use to help distinguish where they are and have a point to look for when lost. This was a very important learning experience for us as we were more focused on the base mechanics, visuals, and game features at the start of development." }
        ],
        "images": [
            {"src": "../assets/images/thepark/gameplay.gif", "caption": "Gameplay of the player following a direction arrow."},
            {"src": "../assets/images/thepark/tutorial.gif", "caption": "The discovery of the first key and the possible paths a player can take."}
        ],
        "herodata": [
            {"role": "Level Designer",
            "role2": "Programmer",
            "skills": "Godot",
            "skills2": "GDScript",
            "genre": "Survival",
            "genre2": "Horror",
            "linkname": "Itch.io", "linkurl":"https://hatbringer.itch.io/the-park-inbetween"}
        ]
    },
    {
        "img": "../assets/images/guidingsouls/thumbnail.png",
        "alt": "Guiding Souls",
        "name": "GUIDING SOULS",
        "button": "A 2D puzzle game where you, a janitor of the underworld must clean up the lost souls scattered throughout the dungeon. ",
        "info": "Unity / C#",
        "link": "/works/guidingsouls",
        "content": [
            { "title": "Summary", "paragraph": "Guiding Souls is a 2D puzzle game that we created for Global Game Jam 2021. With the theme being lost & found, our team of three came up with a top-down, level based game where you control a janitor of the Underworld that has to clean up the lost souls scattered everywhere. Each level is played as an escort mission where you must bring the right amount of lost souls to the portal gate which will take you to the next level. Souls that you collect follow you similiar to how eggs follow Yoshi in Yoshi's Story but movement is isometric top-down with the souls being sent back when touched by monsters." },
            { "title": "Design", "paragraph": "The level design is structured in a set of levels that follow the pattern of mechanic introduction, then a challenge utilizing the mechanic. This structure is a simple way to introduce a new mechanic to the player as well as keep them engaged as they progress through the game. Since the controls and mechanics are simple, the complexity comes from the mixture of multiple obstacles leading to more challenging puzzles. This can come in any combination of souls, enemies, and enviroment as well as their amount, position, and type." },
            { "title": "", "paragraph": "One of the more interesting gameplay interaction was the players ability to throw a collected soul. As the collected souls follow the player, their speed is much slower than the speed of the player so there are many situations for them to be caught by enemies. So with the throw ability players are able to manuaver the souls in a way to get over many different obstacles. This helped influence the level design as walls, and obstacles can also be used as an advantage for players so we had to keep that in mind for each levels creation." },
            { "title": "Development", "paragraph": "To play to the strengths of our team, we made sure to program features to showcase the various roles of my teammates. We had a narrative designer, and the visual effect artist, so we needed a way to incorporate the games story as well as include effects to enhance the game. For the narrative design, we created a dialogue system where the Janitor talks to you, explaining the world, controls, as well as hints for each level. For effects since the focus of the game was finding lost souls, we focused most of the VFX on the souls and portal gates to showcase how souls were cleaned up." }
        ],
        "images": [
            {"src": "../assets/images/guidingsouls/gameplay.gif", "caption": "Gameplay of one of the beginning levels of the Guiding Souls."},
            {"src": "../assets/images/guidingsouls/introduction.png", "caption": ""},
            {"src": "../assets/images/guidingsouls/challenge.png", "caption": ""},
            {"src": "../assets/images/guidingsouls/gameplay2.gif", "caption": "From left to right, a level introducing the slower yellow souls combined with spikes, the challenge level of the introduced mechanics, and gameplay of both."},
            {"src": "../assets/images/guidingsouls/throwing.gif", "caption": "Using the throw mechanic to bypass the fast moving red skeletons."},
            {"src": "../assets/images/guidingsouls/features.gif", "caption": "Example of our dialogue and VFX features."}
        ],
        "herodata": [
            {"role": "Programmer",
            "role2": "Game Designer",
            "skills": "Unity",
            "skills2": "C#",
            "genre": "Puzzle",
            "genre2": "Top-Down",
            "linkname": "Itch.io", "linkurl":"https://agehm.itch.io/guiding-souls"}
        ]
    },
    {
        "img": "../assets/images/lumera/thumbnail.png",
        "alt": "Lumera",
        "name": "LUMERA",
        "button": "A 3D action role playing game where the summmoned hero must defend the world tree from the corrupted monsters that are trying to invade.",
        "info": "UE4 / Blueprints",
        "link": "/works/lumera",
        "content": [
            { "title": "Summary", "paragraph": "Lumera is a 3D action role playing game that my team and I created for our Advanced Game Design course. The objective of the project was to create a playable game demo with an engine of choice. We decided to push out of our comfort zone and utilize an engine that none of us had used before, Unreal Engine 4. Our vision was to create a boss battler similiar to Shadow Of Colossus but on a smaller scale along a cutscene system to tell the story of lumera and the summoned protagonist." },
            { "title": "Design", "paragraph": "One of the main designs that I worked on was developing an introduction boss to on board the player into the game and the story. The core story of our game was that the protagonist was summoned into the world to protect Lumera, the world tree from the upcoming invasion from monsters of different realms. So I decided to split the introduction boss into three seperate boss fights to emphasize the concepts of monsters invading and portals to other worlds. This lead to the creation of the Oni Brothers, three sibling monsters that invade one by one starting with the youngest and ending on the oldest who seeks revenge for the defeat of their kin." },
            { "title": "Development", "paragraph": "As part of our assignment, we had to include one unique game mechanic along with the basic mechanics that were used within the genres that we choose. The idea that we came up with was enabling the player to have an enhanced attack if they were able to time the guage correctly. With this enhanced attack, the player was able to deal more damage as well as trigger interactions with the bosses and the environment. Some of the interactions that we created include breaking armor of a boss, destroying rocks on the field, and reflecting back boss attacks." }
        ],
        "images": [
            {"src": "../assets/images/lumera/gameplay.gif", "caption": "Gameplay of the final boss of the Lumera demo."},
            {"src": "../assets/images/lumera/blueoni.png", "caption": ""},
            {"src": "../assets/images/lumera/redoni.png", "caption": ""},
            {"src": "../assets/images/lumera/onichan.png", "caption": "From left to right, we have Buru, Reddo, and Onichan."},
            {"src": "../assets/images/lumera/interaction.gif", "caption": "Timing the gauge attack correctly results in environmental interactions."}
        ],
        "herodata": [
            {"role": "Project Manager",
            "role2": "Game Developer",
            "skills": "Unreal Engine 4",
            "skills2": "Blueprints",
            "genre": "RPG",
            "genre2": "Action",
            "linkname": "Demo", "linkurl":"https://drive.google.com/file/d/1JIQHY6eh8YZYEozubh3pIR_4k-v6RkT8/view?usp=sharing"}
        ]
    }
]